// Добавление записей в новую коллекцию

db.articles.insertMany([
    {
        "title": "Акции компаний растут",
        "anons": "Компании стременительно набирают обороты",
        "text": "Рост акций по всем фронтам",
        "date": new Date('2020-11-11')
    },
    {
        "title": "Открытие кофейни",
        "anons": "Новая кофейня была открыта в городе Чишки",
        "text": "Все жители страны празднуют этот день!",
        "date": new Date('2021-11-11')
    },
    {
        "title": "Новости города",
        "anons": "Подставки для компьютеров",
        "text": "Новые подсткавки для компьютеров были завезены в магазины",
        "date": new Date('2022-11-11')
    }
])

// Создание индексов для отслеживания
db.articles.createIndex({title: "text", anons: "text", text: "text"})

// Поиск данных по конкретному слову
db.articles.find({ $text: {$search: "кофейни"} })


// Сортировка данных по релевантности
db.articles.find(
    { $text: {$search: "Открытие кофейня"} },
    {score: {$meta: "textScore"}}
).sort({score: {$meta: "textScore"}})